app/controllers/foods_controller.rb

SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."food_id" = $1  [["food_id", 3]]
---
  def missing_foods
    recipes_with_foods = current_user.recipes.includes(:foods)
    food_ids_from_recipes = recipes_with_foods.flat_map { |recipe| recipe.foods.pluck(:id) }
    inventory_foods = current_user.inventories.flat_map { |inventory| inventory.inventory_foods.includes(:food) }
    food_ids_from_inventory = inventory_foods.flat_map { |inv_food| inv_food.food.id }
    missing_foods_from_recipes = current_user.foods.where.not(id: food_ids_from_recipes)
    missing_foods_from_inventory = current_user.foods.where.not(id: food_ids_from_inventory)