app/controllers/foods_controller.rb

  def index
    @is_active = true
    if params[:id] == 'missing_foods'
      missing_foods
      render :missing_foods
    else
      @foods = Food.all
---
SELECT "foods".* FROM "foods"

  def show
    if params[:id] == 'missing_foods'
      missing_foods
      render :missing_foods
    else
      @food = Food.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def missing_foods
    # Preload the foods association for current_user.recipes
    recipes_with_foods = current_user.recipes.includes(:foods)

    # Extract all food_ids from recipes
    food_ids_from_recipes = recipes_with_foods.flat_map { |recipe| recipe.foods.pluck(:id) }

    # Find missing foods that are not present in recipes
    @missing_foods = current_user.foods.where.not(id: food_ids_from_recipes)

    @total_items = @missing_foods.count
    @total_price = @missing_foods.sum(&:price)
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" NOT IN ($2, $3, $4, $5, $6)  [["user_id", 1], ["id", 1], ["id", 10], ["id", 8], ["id", 4], ["id", 2]]
SELECT "food_id" FROM "recipes" INNER JOIN "recipe_foods" ON "recipe_foods"."recipe_id" = "recipes"."id" INNER JOIN "foods" ON "foods"."id" = "recipe_foods"."food_id" WHERE "recipes"."user_id" = $1  [["user_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 1], ["id", 8], ["id", 10], ["id", 4], ["id", 2], ["id", 3]]
SELECT COUNT(*) FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" NOT IN ($2, $3, $4, $5, $6, $7, $8)  [["user_id", 1], ["id", 1], ["id", 8], ["id", 8], ["id", 1], ["id", 10], ["id", 4], ["id", 2]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = $1 AND "foods"."id" NOT IN ($2, $3, $4, $5, $6, $7, $8)  [["user_id", 1], ["id", 1], ["id", 8], ["id", 8], ["id", 1], ["id", 10], ["id", 4], ["id", 2]]

  def create
    @food = current_user.foods.new(food_params)
    if @food.save
---
INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Eto"], ["measurement_unit", "kg"], ["price", "25.4"], ["quantity", 3], ["user_id", 1], ["created_at", "2023-12-08 19:13:37.718637"], ["updated_at", "2023-12-08 19:13:37.718637"]]

  def destroy
    @food = Food.find(params[:id])
    if current_user == @food.user
      @food.destroy
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 3]]