app/controllers/foods_controller.rb

INSERT INTO "foods" ("name", "measurement_unit", "price", "quantity", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Talia"], ["measurement_unit", "kg"], ["price", "14.5"], ["quantity", 15], ["user_id", 1], ["created_at", "2023-12-05 23:13:39.855230"], ["updated_at", "2023-12-05 23:13:39.855230"]]
---
  def create
    @food = current_user.foods.new(food_params)
    if @food.save