app/controllers/general_shopping_list_controller.rb

    def index
      @all_recipes = Recipe.all
      @recipes = current_user.recipes.includes(:foods)
---
SELECT "recipes".* FROM "recipes"