app/controllers/inventory_foods_controller.rb

  def set_inventory
    @inventory = Inventory.find(params[:inventory_id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_inventory_food
    @inventory_food = @inventory.inventory_foods.find(params[:id])
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "inventory_foods".* FROM "inventory_foods" WHERE "inventory_foods"."inventory_id" = $1  [["inventory_id", 1]]