app/controllers/inventories_controller.rb

SELECT "inventories".* FROM "inventories" WHERE "inventories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @inventory = Inventory.find(params[:id])

INSERT INTO "inventories" ("name", "description", "users_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "kjd"], ["description", "gdsf"], ["users_id", 1], ["created_at", "2023-12-08 13:49:23.294699"], ["updated_at", "2023-12-08 13:49:23.294699"]]
---
  def create
    @inventory = Inventory.new(inventory_params)
    @inventory.user = current_user
    if @inventory.save