app/controllers/recipes_controller.rb

  def index
    @public_recipes = Recipe.where(public: true).includes(recipe_foods: :food)

    if @public_recipes.present?
      @total_food_items = @public_recipes.sum { |recipe| recipe.recipe_foods.sum(:quantity) } || 0
      @total_price = @public_recipes.sum { |recipe| recipe.recipe_foods.sum { |rf| rf.quantity * rf.food.price } } || 0
---
SELECT "recipes".* FROM "recipes"
SELECT 1 AS one FROM "recipes" LIMIT $1  [["LIMIT", 1]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" IN ($1, $2)  [["recipe_id", 1], ["recipe_id", 2]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]

  def create
    @recipe = current_user.recipes.build(recipe_params)

    if @recipe.save
---
INSERT INTO "recipes" ("name", "preparation_time", "cooking_time", "description", "public", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    @recipe = Recipe.find(params[:id])
    authorize! :destroy, @recipe
    @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 2]]

  def show
    @recipe = Recipe.includes(:foods).find(params[:id])
    @foods = @recipe.foods
    @inventories = Inventory.all
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]
SELECT "inventories".* FROM "inventories"

  def public_list
    @public_recipes = Recipe.includes(:foods).where(public: true).order(created_at: :desc)

    # Debug output
    puts "Debug - Public Recipes: #{@public_recipes.inspect}"

    if @public_recipes.present?
      @total_food_items = @public_recipes.sum { |recipe| recipe.recipe_foods.sum(:quantity) } || 0
      @total_price = @public_recipes.sum { |recipe| recipe.recipe_foods.sum { |rf| rf.quantity * rf.food.price } } || 0
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."public" = $1 ORDER BY "recipes"."created_at" DESC  [["public", true]]
SELECT "recipe_foods".* FROM "recipe_foods" WHERE "recipe_foods"."recipe_id" = $1  [["recipe_id", 1]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1  [["id", 2]]