app/controllers/users_controller.rb

      def show
        if params[:id] == 'sign_out'
          sign_out(current_user)
          redirect_to new_user_session_path, notice: 'You have signed out.'
        else
          @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]