app/models/inventory.rb

SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def total_price
    inventory_foods.sum { |inventory_food| inventory_food.food.price * inventory_food.quantity }